fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОкончаниеДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
// {{Борисова А.В.
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриОткрытии(Отказ)
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Элементы.ПолеАбонентскаяПлата.Видимость  	= Истина;
    	Элементы.ПолеНачалоДействия.Видимость  	 	= Истина;
 		Элементы.ПолеОкончаниеДействия.Видимость  	= Истина;
		Элементы.ПолеСтоимостьЧасаРаботы.Видимость 	= Истина; 
	Иначе
		Элементы.ПолеАбонентскаяПлата.Видимость  	= Ложь;
    	Элементы.ПолеНачалоДействия.Видимость  	 	= Ложь;
 		Элементы.ПолеОкончаниеДействия.Видимость  	= Ложь;
		Элементы.ПолеСтоимостьЧасаРаботы.Видимость 	= Ложь;  
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	ВидДоговораПриИзмененииНаСервере() ;
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Элементы.ПолеАбонентскаяПлата.Видимость  	= Истина;
    	Элементы.ПолеНачалоДействия.Видимость  	 	= Истина;
 		Элементы.ПолеОкончаниеДействия.Видимость  	= Истина;
		Элементы.ПолеСтоимостьЧасаРаботы.Видимость 	= Истина; 
	Иначе
		Элементы.ПолеАбонентскаяПлата.Видимость  	= Ложь;
    	Элементы.ПолеНачалоДействия.Видимость  	 	= Ложь;
 		Элементы.ПолеОкончаниеДействия.Видимость  	= Ложь;
		Элементы.ПолеСтоимостьЧасаРаботы.Видимость 	= Ложь;  
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	ДобавлениеРеквизитов = Элементы.Добавить("ПолеАбонентскаяПлата",Тип("ПолеФормы"),ЭтотОбъект);	
	ДобавлениеРеквизитов.Вид = ВидПоляФормы.ПолеВвода;
	ДобавлениеРеквизитов.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
	
	ДобавлениеРеквизитов = Элементы.Добавить("ПолеНачалоДействия",Тип("ПолеФормы"),ЭтотОбъект);	
	ДобавлениеРеквизитов.Вид = ВидПоляФормы.ПолеВвода;
	ДобавлениеРеквизитов.ПутьКДанным = "Объект.ВКМ_НачалоДействия";
	
	ДобавлениеРеквизитов = Элементы.Добавить("ПолеОкончаниеДействия",Тип("ПолеФормы"),ЭтотОбъект);	
	ДобавлениеРеквизитов.Вид = ВидПоляФормы.ПолеВвода;
	ДобавлениеРеквизитов.ПутьКДанным = "Объект.ВКМ_ОкончаниеДействия";
	
	ДобавлениеРеквизитов = Элементы.Добавить("ПолеСтоимостьЧасаРаботы",Тип("ПолеФормы"),ЭтотОбъект);	
	ДобавлениеРеквизитов.Вид = ВидПоляФормы.ПолеВвода;
	ДобавлениеРеквизитов.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
			Элементы.ПолеАбонентскаяПлата.Видимость	 	= Истина;
    		Элементы.ПолеНачалоДействия.Видимость  	 	= Истина;
			Элементы.ПолеОкончаниеДействия.Видимость  	= Истина;
			Элементы.ПолеСтоимостьЧасаРаботы.Видимость 	= Истина;  	
	Иначе
			Элементы.ПолеАбонентскаяПлата.Видимость  	= Ложь;
    		Элементы.ПолеНачалоДействия.Видимость  	 	= Ложь;
 			Элементы.ПолеОкончаниеДействия.Видимость  	= Ложь;
			Элементы.ПолеСтоимостьЧасаРаботы.Видимость 	= Ложь;   	 
	КонецЕсли;

КонецПроцедуры
#КонецОбласти
//Борисова А.В.}}
